In [24]:
import pandas as pd
import numpy as np

In [25]:
df=pd.read_csv("placement.csv")

In [26]:
df.head()

   cgpa  resume_score  placed
0  8.14          6.52       1
1  6.17          5.17       0
2  8.27          8.86       1
3  6.88          7.27       1
4  7.52          7.30       1

In [27]:
df.shape

(100, 3)

In [28]:
x = df.drop(columns = ['placed'])  ## Input data
x.shape

(100, 2)

In [29]:
y = df['placed']  ##target data
y.shape

(100,)

In [30]:
!pip install scikit-learn

Requirement already satisfied: scikit-learn in c:\users\bishn\appdata\local\programs\python\python311\lib\site-packages (1.6.0)
Requirement already satisfied: numpy>=1.19.5 in c:\users\bishn\appdata\local\programs\python\python311\lib\site-packages (from scikit-learn) (2.2.0)
Requirement already satisfied: scipy>=1.6.0 in c:\users\bishn\appdata\local\programs\python\python311\lib\site-packages (from scikit-learn) (1.15.0)
Requirement already satisfied: joblib>=1.2.0 in c:\users\bishn\appdata\local\programs\python\python311\lib\site-packages (from scikit-learn) (1.4.2)
Requirement already satisfied: threadpoolctl>=3.1.0 in c:\users\bishn\appdata\local\programs\python\python311\lib\site-packages (from scikit-learn) (3.5.0)

In [31]:
from sklearn.model_selection import train_test_split

In [32]:
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size = 0.2 , random_state = 42)

In [33]:
print("Total data shape:" , df.shape)
print("Input(x) data shape:" , x.shape)
print("x_train data shape:" , x_train.shape)
print("x_test data shape:" , x_test.shape)


print("Target(y) data shape:" , y.shape)
print("y_train data shape:" , y_train.shape)
print("y_test data shape:" , y_test.shape)

Total data shape: (100, 3)
Input(x) data shape: (100, 2)
x_train data shape: (80, 2)
x_test data shape: (20, 2)
Target(y) data shape: (100,)
y_train data shape: (80,)
y_test data shape: (20,)

In [34]:
# df(100,3) = x(100,2) + y(100,1) 

# x(100,2) = x_train(80,2) + x_test(20,2) 

# y(100,1) = y_train(80,1) + y_test(20,1)

In [35]:
df1=pd.read_csv("covid_toy.csv")

In [36]:
df1.head()

   age  gender  fever cough     city has_covid
0   60    Male  103.0  Mild  Kolkata        No
1   27    Male  100.0  Mild    Delhi       Yes
2   42    Male  101.0  Mild    Delhi        No
3   31  Female   98.0  Mild  Kolkata        No
4   65  Female  101.0  Mild   Mumbai        No

df1.isnull().sum()

In [37]:
df1.isnull().sum()

age           0
gender        0
fever        10
cough         0
city          0
has_covid     0
dtype: int64

In [38]:
df1=df1.dropna()
df1.isnull().sum()

age          0
gender       0
fever        0
cough        0
city         0
has_covid    0
dtype: int64

In [39]:
df1.shape

(90, 6)

In [40]:
x = df1.drop(columns = ['has_covid'])
y = df1['has_covid']

In [41]:
from sklearn.model_selection import train_test_split

In [42]:
x_train , x_test , y_train , y_test = train_test_split(x,y,test_size = 0.2 , random_state = 42)

In [43]:
print("Total data shape:" , df1.shape)
print("Input(x) data shape:" , x.shape)
print("x_train data shape:" , x_train.shape)
print("x_test data shape:" , x_test.shape)


print("Target(y) data shape:" , y.shape)
print("y_train data shape:" , y_train.shape)
print("y_test data shape:" , y_test.shape)

Total data shape: (90, 6)
Input(x) data shape: (90, 5)
x_train data shape: (72, 5)
x_test data shape: (18, 5)
Target(y) data shape: (90,)
y_train data shape: (72,)
y_test data shape: (18,)

In [44]:
# df(100,6) = x(100,5) + y(100,1)

# x(100,5) = x_train(80,5) + x_test(20,5)

# y(100,1) = y_train(80,1) + y_test(20,1)

In [45]:
x_train , x_test , y_train , y_test = train_test_split( x , y , test_size = 0.2 , random_state= 42)

In [47]:
df2=pd.read_csv("titanic.csv")

In [48]:
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [49]:
df2.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [50]:
df2=df2.dropna()

In [51]:
df2.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [52]:
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,904,1,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
14,906,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
24,916,1,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.0,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
26,918,1,1,"Ostby, Miss. Helene Ragnhild",female,22.0,0,1,113509,61.9792,B36,C
28,920,0,1,"Brady, Mr. John Bertram",male,41.0,0,0,113054,30.5000,A21,S

In [54]:
x=df2.drop(columns = ['Survived'])
y=df2['Survived']

In [59]:
x_train , x_test , y_train , y_test = train_test_split(x,y, test_size=0.2 , random_state=42)

In [58]:
print("Total data shape:" , df2.shape)
print("Input(x) data shape:" , x.shape)
print("x_train data shape:" , x_train.shape)
print("x_test data shape:" , x_test.shape)


print("Target(y) data shape:" , y.shape)
print("y_train data shape:" , y_train.shape)
print("y_test data shape:" , y_test.shape)

Total data shape: (87, 12)
Input(x) data shape: (87, 11)
x_train data shape: (69, 11)
x_test data shape: (18, 11)
Target(y) data shape: (87,)
y_train data shape: (69,)
y_test data shape: (18,)

In [60]:
df3=pd.read_csv("tips.csv")

In [62]:
df3.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [63]:
df3.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [66]:
x=df3.drop(columns = ['total_bill'])
y=df3['total_bill']

x=df3.drop(columns = ['total_bill'])
y=df3['total_bill']

In [67]:
x_train , x_test , y_train , y_test = train_test_split(x,y, test_size=0.2 , random_state=42)

In [68]:
print("Total data shape:" , df3.shape)
print("Input(x) data shape:" , x.shape)
print("x_train data shape:" , x_train.shape)
print("x_test data shape:" , x_test.shape)


print("Target(y) data shape:" , y.shape)
print("y_train data shape:" , y_train.shape)
print("y_test data shape:" , y_test.shape)

Total data shape: (244, 7)
Input(x) data shape: (244, 6)
x_train data shape: (195, 6)
x_test data shape: (49, 6)
Target(y) data shape: (244,)
y_train data shape: (195,)
y_test data shape: (49,)

In [69]:
df4=pd.read_csv("Attrition.csv")

In [75]:
df4.isnull().sum()

Age                         0
Attrition                   0
BusinessTravel              0
DailyRate                   0
Department                  0
DistanceFromHome            0
Education                   0
EducationField              0
EmployeeCount               0
EmployeeNumber              0
EnvironmentSatisfaction     0
Gender                      0
HourlyRate                  0
JobInvolvement              0
JobLevel                    0
JobRole                     0
JobSatisfaction             0
MaritalStatus               0
MonthlyIncome               0
MonthlyRate                 0
NumCompaniesWorked          0
Over18                      0
OverTime                    0
PercentSalaryHike           0
PerformanceRating           0
RelationshipSatisfaction    0
StandardHours               0
StockOptionLevel            0
TotalWorkingYears           0
TrainingTimesLastYear       0
WorkLifeBalance             0
YearsAtCompany              0
YearsInCurrentRole          0
YearsSinceLastPromotion     0
YearsWithCurrManager        0
dtype: int64

In [71]:
df4.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [72]:
x=df4.drop(columns=['Attrition'])
y=df4['Attrition']

In [73]:
x_train , x_test , y_train ,y_test = train_test_split(x,y , test_size=0.2 , random_state = 42)

In [74]:
print("Total data shape:" , df4.shape)
print("Input(x) data shape:" , x.shape)
print("x_train data shape:" , x_train.shape)
print("x_test data shape:" , x_test.shape)


print("Target(y) data shape:" , y.shape)
print("y_train data shape:" , y_train.shape)
print("y_test data shape:" , y_test.shape)

Total data shape: (1470, 35)
Input(x) data shape: (1470, 34)
x_train data shape: (1176, 34)
x_test data shape: (294, 34)
Target(y) data shape: (1470,)
y_train data shape: (1176,)
y_test data shape: (294,)

In [76]:
df5=pd.read_csv("supply_chain.csv")

In [77]:
df5.head()

,Product type,SKU,Price,Availability,Number of products sold,Revenue generated,Customer demographics,Stock levels,Lead times,Order quantities,...,Location,Lead time,Production volumes,Manufacturing lead time,Manufacturing costs,Inspection results,Defect rates,Transportation modes,Routes,Costs
0,haircare,SKU0,69.808006,55,802,8661.996792,Non-binary,58,7,96,...,Mumbai,29,215,29,46.279879,Pending,0.226410,Road,Route B,187.752075
1,skincare,SKU1,14.843523,95,736,7460.900065,Female,53,30,37,...,Mumbai,23,517,30,33.616769,Pending,4.854068,Road,Route B,503.065579
2,haircare,SKU2,11.319683,34,8,9577.749626,Unknown,1,10,88,...,Mumbai,12,971,27,30.688019,Pending,4.580593,Air,Route C,141.920282
3,skincare,SKU3,61.163343,68,83,7766.836426,Non-binary,23,13,59,...,Kolkata,24,937,18,35.624741,Fail,4.746649,Rail,Route A,254.776159
4,skincare,SKU4,4.805496,26,871,2686.505152,Non-binary,5,3,56,...,Delhi,5,414,3,92.065161,Fail,3.145580,Air,Route A,923.440632

In [78]:
#we have to learn that we have to know at github there will be one admin or
#superuser anybody else  that will require to get acces to make a change in the github

In [84]:
x=df5.drop(columns=['SKU'])
y=df5['SKU']

In [85]:
x_train , x_test , y_train ,y_test = train_test_split(x,y , test_size=0.2 , random_state = 42)

In [86]:
print("Total data shape:" , df5.shape)
print("Input(x) data shape:" , x.shape)
print("x_train data shape:" , x_train.shape)
print("x_test data shape:" , x_test.shape)


print("Target(y) data shape:" , y.shape)
print("y_train data shape:" , y_train.shape)
print("y_test data shape:" , y_test.shape)

Total data shape: (100, 24)
Input(x) data shape: (100, 23)
x_train data shape: (80, 23)
x_test data shape: (20, 23)
Target(y) data shape: (100,)
y_train data shape: (80,)
y_test data shape: (20,)